#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.ct_config.ignition will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "ignition" {
      + content      = (known after apply)
      + files_dir    = "./.."
      + id           = (known after apply)
      + pretty_print = false
      + rendered     = (known after apply)
      + strict       = true
    }

  # null_resource.regenerate_key must be replaced
-/+ resource "null_resource" "regenerate_key" {
      ~ id       = "4887305391230169470" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "bootstrap_config_hash" = "426a12e380cba8b853aa291bd2c2347c1ea549fd4e244e7ad846b54f447fd753" -> "55eaf28c6c41403a22197cd024a756335af88346fe15493b3a866faba25f4bd4"
            # (11 unchanged elements hidden)
        }
    }

  # oci_core_instance.this must be replaced
-/+ resource "oci_core_instance" "this" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.uk-london-1.abwgiljtiy7a7lhgxfzjfybtrwfbxdm6wsa2a3w3if75h2nw4xe5kx3s7o2a" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/terraform" -> null
          - "Oracle-Tags.CreatedOn" = "2026-02-01T23:50:15.475Z" -> null
            # (3 unchanged elements hidden)
        }
      ~ extended_metadata                   = {} -> (known after apply)
      ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      + hostname_label                      = (known after apply)
      ~ id                                  = "ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7ac4vvxqfciwoeejqx2j2d2tvwhzlgq7gerltfcrow6pzra" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.uk-london-1.aaaaaaaaze7uoavoo7lblhkq4rzfclpwrrfoubqvqiprstvqtpvi4j4ymfka" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_ai_enterprise_enabled            = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "user_data" = "eyJpZ25pdGlvbiI6eyJjb25maWciOnsicmVwbGFjZSI6eyJ2ZXJpZmljYXRpb24iOnt9fX0sInByb3h5Ijp7fSwic2VjdXJpdHkiOnsidGxzIjp7fX0sInRpbWVvdXRzIjp7fSwidmVyc2lvbiI6IjMuNC4wIn0sImtlcm5lbEFyZ3VtZW50cyI6e30sInBhc3N3ZCI6e30sInN0b3JhZ2UiOnsiZGlyZWN0b3JpZXMiOlt7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvZGF0YSIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9yZXBvIiwidXNlciI6e30sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2VudiIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzIiwidXNlciI6e30sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvZXRjL29jaS12YXVsdCIsInVzZXIiOnt9LCJtb2RlIjo0NDh9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9yY2xvbmUiLCJ1c2VyIjp7fSwibW9kZSI6NDQ4fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvYnVja2V0IiwidXNlciI6e30sIm1vZGUiOjQ0OH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NlY3JldHMiLCJ1c2VyIjp7fSwibW9kZSI6NDQ4fV0sImZpbGVzIjpbeyJncm91cCI6e30sInBhdGgiOiIvZXRjL3RtcGZpbGVzLmQvb2NpLWFwcHMuY29uZiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LGQlMjAlMkZydW4lMkZzZWNyZXRzJTIwMDc1NSUyMHJvb3QlMjByb290JTIwLSUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy96aW5jYXRpL2NvbmZpZy5kLzU1LXVwZGF0ZS1zdHJhdGVneS50b21sIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LFczVndaR0YwWlhOZENuTjBjbUYwWldkNUlEMGdJbkJsY21sdlpHbGpJZ29LVzF0MWNHUmhkR1Z6TG5CbGNtbHZaR2xqTG5kcGJtUnZkMTFkQ21SaGVYTWdQU0JiSUNKVGRXNGlJRjBLYzNSaGNuUmZkR2x0WlNBOUlDSXdNem93TUNJS2JHVnVaM1JvWDIxcGJuVjBaWE1nUFNBeE1qQUsiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDIwfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvb2NpLXZhdWx0L2NvbmZpZyIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzV6UHUyNnNNQmdFNEg3ZlpaRTQzS3BUckFnRjBpcUpnQ1FsK3JIeHdtTDhZK01iZnZvb1NSbWwyYWxHMDN5YTk4dmJ0ZXZicW15cXJxK2YrdkphVjg5ZjdUK1NtY2FSQmNQMVBoSTE2Z2hKSEpubHpGRlFGT2M0Z2hXKzQvZ1VvQURBa0pHSlNqNTZBOGVOSEVzV0RwcXp3U1NVMFgzTEJSK1VkV1l1VkFhblArQ2Y0UUU4R3pWTHVWYnJQZHo5TUJNWjdDd0tTS1oxMDRqL1RNNlVsK1ltQ3JmS1gzaFR0VjFkOXErWHR2MTRhUjc1bm5MbldJRnEySUdndFg0eGR0aU5UQVJKTjNCZXpjRWpPY0xDZkM1UG53RUFBUC8vN3R6ZTVIVUJBQUE9IiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjM4NH0seyJncm91cCI6e30sInBhdGgiOiIvZXRjL3JjbG9uZS9yY2xvbmUuY29uZiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LCU1Qm9jaS1iYWNrdXAlNUQlMEF0eXBlJTIwJTNEJTIwb3JhY2xlb2JqZWN0c3RvcmFnZSUwQXByb3ZpZGVyJTIwJTNEJTIwaW5zdGFuY2VfcHJpbmNpcGFsX2F1dGglMEFuYW1lc3BhY2UlMjAlM0QlMjBscmt5MGYxbm1vdHMlMEFyZWdpb24lMjAlM0QlMjB1ay1sb25kb24tMSUwQW5vX2NoZWNrX2J1Y2tldCUyMCUzRCUyMHRydWUlMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6Mzg0fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvYnVja2V0L2NvbmZpZyIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LEJVQ0tFVF9OQU1FJTNEb2NpLWFwcHMlMEFPQ0lfTkFNRVNQQUNFJTNEbHJreTBmMW5tb3RzJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjM4NH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvZmlyc3QtYm9vdC5zaCIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzN5UndXb2JRUXlHNy9zVXF0dFRZWFlQS1EwVVNnL3V4UkFJTkwyRllNYXoydDBoTXlOVjBycHh5TU9YM2NSMldFeHZnL1RQSi9IcDQ0ZG1GMHV6OHpwVWlnWU9Sd0tPakoyUHFhb3dEQVNybi9TM0pQSnRMRDM4OWpGcDhBbnJ1bDVWWVpRRXJ0TzdHeGpNV0w4MURULzJXdHNwRlNnM2FuNlhzRGtWdDhrYnFtMjk1SzlmYXV1ZndSRTBsdmtjbWFxVmVRSDM5TnhkNklGYno5VXE4S0s3L1h4Ky82ZlZRak9xTkltQ1Q3T0NTakk0dVRoclNYblRjbElCc2FqNU5FR05sdHpWMGVMbU5UUko1SU1OVks0Y1I1NDFDbWRIYW9JbkZEam5tZFBCcGJqSDkva0x0TnYxQnRZM0cvQ2xCYVkyKytJQ1pTWjl2UkZIdm5xSFpjRXVQbjAvYndrVW9nc3BMdjRlQjYwSERJL1RtSTRFYnU5ZzVIYTYzbkx2a1h2eExjTExDOXpmdzZjZjRQQVBYRi9EdzhNUjlBc3o3U2NRTVJiVndTbktIbVVKb2oyS3hCWkJwand1MG1mWWpzZ21taEhNcGlBTXZ2UnZpK2xCRFhPd0JESUhxMzhCQUFELy94Q2MzNXZvQWdBQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzL2ZldGNoLWNvbmZpZy5zaCIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzRSVTMyL2NOZ3grMTEvQmFYN0lyZk01eWQ3YWVjTTF5YkJpU1J1a0NiQmhHdzZ5VEorNWt5VlZvbmZOaXY3dmczL2QrWW9VZWJKSmZ2eEVrWi80N1RkWlFUWXJWS3hGUklZVVd3ZWVQRmFLakJBM3E5L1hxL3Y3cTV2YisvZjUrYW00dkxwZS9aSC9jQ3BlUDF6OGRuVy9mcnU2dWNwbGNpYm5qdmUzcTR2T2V5NUZsN20rZkhPWHk0d2JuemxOcVhhMm9rMWF1cDAxVHBWUzNGM2R2bHMvM0YzbnNtYjI4V1dXYllqcnRsaHExMlNGWXJLazFYOTlydkkrTGpmRVk5SkE3RHhuQWIzYkk4Ym82N3ZWMjR0ZmM5a29zbEtJNmNEMWpyaGVCK1JBR0U4VzhFa0FHS2VWQVIrd29vOTVjcmIzbEJnNVQ4NzN0bUxHeG5OK0pnUkFzeTBwUU9wQkpoMU9Db0RRUUJvcWtNbDBiM21NTzdnRndLNG1nM0J5TXJIQ2p6bk0rdzJMeFNzb25RQUFRRjA3a0tzUm1Jd1pXVExIdjRUTDhZcGtONUFNdHdGMk1KYlhFM1V6Zm9IOXI5TUVMb0lyL2tITlVMUm11eDhLL05VakFOSlV0VndEMmNqS2FsejdRRmFUVjJhR3NLckI2SlZHa01tWEtwQXpYTkhxTFhJUFAwYk9RV1BWY2l4L0hwcUtTN3Qyem5vNWc3aC9NZXdDOFhEQllXYVJGYmN4VDM3ZTN6L0ZvUmRVd1orUURIRkk4UU9jd3QrdmdHdTBJMkVQU012WllkbStybU1rZ1BhUWhxZVEzNDM2eU9TSXJXajhlVkl0ZlFDNURSWk94UWlmcXAxcDVhY250REtyWjlETEw0b01scUFxeGdCSFdwbDQ0blFrZmlTR3M2TURCNDVKVTFEMVpOOTN4WVhIVG1Ga0lmblVMNFRQY2JsY0RrelJJSHBJZW5mdk9OVDg0Z1VzRmdLZ2RCYkZaeUhHR3BGMTNkRU5lNkVOaXNsWnFJSnI0TjNGR3hoVTAvTS8vWVJCRHBuWmgxYVZCamxtRW1TR3JEUHRMQ3V5R0dJV0h5TmpVOHBuS0ViWW5tR3loKzl6MldRcmlxU1ZHWGRjVHhPYzQyejVKZUk1S2c0S0s5cCtsV2lNUDBlalduWUJJNVArS3RNQklxZVJYQmhudTRrbzd3M3BZUjdkZ28zRUxqejJvNWp0dEpPU3d2aW1wNlVzRjFKc2lFRWJaN0Y3dWVpNWhyTnVCd1JsZFQxQmh3MHRKL1BoN2xyT1dZU3hrTWFaWnpaUkNmM2VQemlFR0lhazJVQ3BzSEUyRGRoMVpoNUFxd3JUVldUZHJsOGJWY0JZaHhpWFhuSGRlN3hSZHFzT3RpVm1EQWM3WUdtb09OaksrN1JRZXR2NkpWT0RvWGR1aUoyUGFYeTBldkR1VzNzczhrNzdvRjNqRFRKSzhYOEFBQUQvL3dXNHRGV05Cd0FBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvZmV0Y2gtYm9vdHN0cmFwLXNlY3JldHMuc2giLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiJnemlwIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LEg0c0lBQUFBQUFBQy83eVVRVzhhUHhERjcvNFU4MS9RUDhuQjBGWlZjNmdhS2FKRVFvcWFDaWc1cEJIeTJyUHNpRjE3YTQ5THFmancxV1ozYVFtVmNxSW4wSGplNzgwYlc5djdiNWlTSGFZcTVDSWdnOFRvb0tJS00wV0ZFRDI0UWRZNUJOUWVPVUFNWkZkQU5yQ3lHcUh5WkRWVnFvQno2MEI3TkdpWlZCSEFJaG8wRjJKME94bC9taThuSHovMHo1Mm1QYWo1bFdtMHBrQllJY05YQVNDbGlwenYrY3ZmL09hMFZaR0JwTCs0L25JN1g4N0dvK200NWkvM1RrbmIvQzJpMzhLWlVhd0d5WUdmMU00eVdrNEc3Wit6VnVMVlJycklWV1RZUWFvQ3Zuc0wwbHlJTGtiajlxK2lOSVZUeEptT1ovUEphUG41ZWphN3Y1dWUvbTZlK1owaVVnOFdxaUNqR1BjNU51Z1JzdnI5b2hHVXdjTUR5SitROVA5NEtidmRRYW5iZUZjK212dng4VDF3amxZQUFLRE9IU1EzaWdvMHdLNngycnRuM3BWd041ckFRc1dDRTdqNi8wMmora0VNcjBWRzljejNuaGhyYlltbDgxdVpLcjJ1WVdXVkJkZ1FQK0dpUjZqUWx4UUNPZHVTT1VjSXJEeUxXS3F3aGxlWGw2SmNHL0lnS3hqNmFJZnRJT0pwVEdrUGcxOGQ5QXpKWmhSSXEwTHFndERXMTNpczY3Ynprclk1RUEzZ0wwdDhwdmNZbUxTc1ZBZ2I1MDJubTlYaG1xOU54MWNydER3WURCSVJ0b0d4MUZ3ME93QXByWk5wNGZUNnFEMmcvMDRhajdCenJ6Q2o5VXM0YnRzNnpLOEFBQUQvLzJPV01LRXhCUUFBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvZ2l0b3BzLXN5bmMuc2giLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiJnemlwIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LEg0c0lBQUFBQUFBQy8yVE93V3JETUF5QTRidWVRdFZ5V0EvR0R6Qnl5TnBBQjkweXdtNWpERGVURzRGbkM5c2Q3TzFMV25ycVdmby82V0ZsRHhMdHdaVVpDbGMwZkVxb291eWRCSUN4ZngrK3R5OWpTelpwdFprMTJUU0pjYXFGNEhuczNqYTdsbjZkUkFLWWZwQ2FXMEZ3bElxZTZ6Ump5bktVaU5SY0F3TFlENXR1M3phUHkwN21QNk11RjhaZDMyM1hNUGF2dzBkL042U3JZbS9JR2tBOGZpSTFGNHh3MVY3T0x6SGgxeFBXbVNNZ0xvcWVRa0JqdkRjcGh2LzdmN3pBT1FBQS8vL0MvcUUzQ1FFQUFBPT0iLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDkzfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvZW52L2ZyZXNocnNzLmVudiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LEZSRVNIUlNTX0hPU1QlM0Ryc3MuZGN1LnNoJTBBRlVMTFRFWFRSU1NfSE9TVCUzRGZ0ci5kY3Uuc2glMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDIwfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvZW52L3BsYW5rYS5lbnYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixQTEFOS0FfSE9TVCUzRHBsYW5rYS5kY3Uuc2glMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDIwfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvZW52L25pdHRlci5lbnYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixOSVRURVJfSE9TVCUzRG5pdHRlci5kY3Uuc2glMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDIwfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvZW52L3JlZGxpYi5lbnYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixSRURMSUJfSE9TVCUzRHJlZGxpYi5kY3Uuc2glMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDIwfV19LCJzeXN0ZW1kIjp7InVuaXRzIjpbeyJlbmFibGVkIjp0cnVlLCJuYW1lIjoicG9kbWFuLnNvY2tldCJ9LHsiY29udGVudHMiOiJbVW5pdF1cbkRlc2NyaXB0aW9uPUZpcnN0IGJvb3QgaW5pdGlhbGl6YXRpb24gKHVwZGF0ZXMgKyBTU0ggcmVtb3ZhbClcbkFmdGVyPW5ldHdvcmstb25saW5lLnRhcmdldFxuV2FudHM9bmV0d29yay1vbmxpbmUudGFyZ2V0XG5Db25kaXRpb25GaXJzdEJvb3Q9eWVzXG5cbltTZXJ2aWNlXVxuVHlwZT1vbmVzaG90XG5FeGVjU3RhcnQ9L29wdC9zY3JpcHRzL2ZpcnN0LWJvb3Quc2hcblxuW0luc3RhbGxdXG5XYW50ZWRCeT1tdWx0aS11c2VyLnRhcmdldFxuIiwiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6ImZpcnN0LWJvb3Quc2VydmljZSJ9LHsiY29udGVudHMiOiJbVW5pdF1cbkRlc2NyaXB0aW9uPVRhaWxzY2FsZSBEYWVtb25cbkFmdGVyPW5ldHdvcmstb25saW5lLnRhcmdldCBmaXJzdC1ib290LnNlcnZpY2VcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuXG5bU2VydmljZV1cblN0YW5kYXJkT3V0cHV0PWpvdXJuYWwrY29uc29sZVxuU3RhbmRhcmRFcnJvcj1qb3VybmFsK2NvbnNvbGVcbkV4ZWNTdGFydD0vdXNyL2xvY2FsL2Jpbi90YWlsc2NhbGVkIC0tc3RhdGU9L3Zhci9saWIvdGFpbHNjYWxlL3RhaWxzY2FsZWQuc3RhdGVcblJlc3RhcnQ9b24tZmFpbHVyZVxuUmVzdGFydFNlYz01XG5cbltJbnN0YWxsXVxuV2FudGVkQnk9bXVsdGktdXNlci50YXJnZXRcbiIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJ0YWlsc2NhbGVkLnNlcnZpY2UifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1BdXRoZW50aWNhdGUgVGFpbHNjYWxlIChpZiBub3QgYWxyZWFkeSBhdXRoZW50aWNhdGVkKVxuQWZ0ZXI9bmV0d29yay1vbmxpbmUudGFyZ2V0IHRhaWxzY2FsZWQuc2VydmljZVxuV2FudHM9bmV0d29yay1vbmxpbmUudGFyZ2V0XG5SZXF1aXJlcz10YWlsc2NhbGVkLnNlcnZpY2VcblxuW1NlcnZpY2VdXG5UeXBlPW9uZXNob3RcblN0YW5kYXJkT3V0cHV0PWpvdXJuYWwrY29uc29sZVxuU3RhbmRhcmRFcnJvcj1qb3VybmFsK2NvbnNvbGVcbkV4ZWNTdGFydD0vYmluL2Jhc2ggLWMgJ1xcXG4gIGlmIC91c3IvbG9jYWwvYmluL3RhaWxzY2FsZSBzdGF0dXMgLS1qc29uIDJcdTAwM2UvZGV2L251bGwgfCBncmVwIC1xIFwiXFxcIkJhY2tlbmRTdGF0ZVxcXCI6XFxcIlJ1bm5pbmdcXFwiXCI7IHRoZW4gXFxcbiAgICBlY2hvIFwiVGFpbHNjYWxlIGFscmVhZHkgYXV0aGVudGljYXRlZFwiOyBcXFxuICBlbHNlIFxcXG4gICAgZWNobyBcIkF1dGhlbnRpY2F0aW5nIFRhaWxzY2FsZS4uLlwiOyBcXFxuICAgIC91c3IvbG9jYWwvYmluL3RhaWxzY2FsZSB1cCAtLWF1dGgta2V5PVwidHNrZXktYXV0aC1rTk12SmozRnk0MjFDTlRSTC1acEh1ZERKd1BaVFJyY214VHd2V1hURzJERjFoNFJjcFFcIiAtLXNzaCAtLWFjY2VwdC1yb3V0ZXM7IFxcXG4gIGZpJ1xuUmVtYWluQWZ0ZXJFeGl0PXllc1xuXG5bSW5zdGFsbF1cbldhbnRlZEJ5PW11bHRpLXVzZXIudGFyZ2V0XG4iLCJlbmFibGVkIjp0cnVlLCJuYW1lIjoidGFpbHNjYWxlLWF1dGguc2VydmljZSJ9LHsiY29udGVudHMiOiJbVW5pdF1cbkRlc2NyaXB0aW9uPUZldGNoIGNvbmZpZ3VyYXRpb24gZnJvbSBPQ0kgYnVja2V0XG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXQgZmlyc3QtYm9vdC5zZXJ2aWNlIHRhaWxzY2FsZS1hdXRoLnNlcnZpY2VcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuUmVxdWlyZXM9Zmlyc3QtYm9vdC5zZXJ2aWNlXG5CZWZvcmU9ZmV0Y2gtYm9vdHN0cmFwLXNlY3JldHMuc2VydmljZVxuQ29uZGl0aW9uUGF0aEV4aXN0cz0hL2V0Yy9mZXRjaC1jb25maWctY29tcGxldGVcblxuW1NlcnZpY2VdXG5UeXBlPW9uZXNob3RcblN0YW5kYXJkT3V0cHV0PWpvdXJuYWwrY29uc29sZVxuU3RhbmRhcmRFcnJvcj1qb3VybmFsK2NvbnNvbGVcbkVudmlyb25tZW50RmlsZT0vZXRjL2J1Y2tldC9jb25maWdcbkV4ZWNTdGFydD0vb3B0L3NjcmlwdHMvZmV0Y2gtY29uZmlnLnNoICR7QlVDS0VUX05BTUV9ICR7T0NJX05BTUVTUEFDRX1cbkV4ZWNTdGFydFBvc3Q9L3Vzci9iaW4vdG91Y2ggL2V0Yy9mZXRjaC1jb25maWctY29tcGxldGVcblJlbWFpbkFmdGVyRXhpdD15ZXNcblxuW0luc3RhbGxdXG5XYW50ZWRCeT1tdWx0aS11c2VyLnRhcmdldFxuIiwiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6ImZldGNoLWNvbmZpZy5zZXJ2aWNlIn0seyJjb250ZW50cyI6IltVbml0XVxuRGVzY3JpcHRpb249RmV0Y2ggYm9vdHN0cmFwIHNlY3JldHMgZnJvbSBPQ0kgVmF1bHRcbkFmdGVyPW5ldHdvcmstb25saW5lLnRhcmdldCBmaXJzdC1ib290LnNlcnZpY2UgZmV0Y2gtY29uZmlnLnNlcnZpY2VcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuUmVxdWlyZXM9ZmV0Y2gtY29uZmlnLnNlcnZpY2VcbkJlZm9yZT1pbmZpc2ljYWwtYWdlbnQuc2VydmljZVxuXG5bU2VydmljZV1cblR5cGU9b25lc2hvdFxuU3RhbmRhcmRPdXRwdXQ9am91cm5hbCtjb25zb2xlXG5TdGFuZGFyZEVycm9yPWpvdXJuYWwrY29uc29sZVxuRW52aXJvbm1lbnRGaWxlPS9ldGMvb2NpLXZhdWx0L2NvbmZpZ1xuRXhlY1N0YXJ0PS9vcHQvc2NyaXB0cy9mZXRjaC1ib290c3RyYXAtc2VjcmV0cy5zaFxuUmVtYWluQWZ0ZXJFeGl0PXllc1xuXG5bSW5zdGFsbF1cbldhbnRlZEJ5PW11bHRpLXVzZXIudGFyZ2V0XG4iLCJlbmFibGVkIjp0cnVlLCJuYW1lIjoiZmV0Y2gtYm9vdHN0cmFwLXNlY3JldHMuc2VydmljZSJ9XX19"
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "172.16.0.20" -> (known after apply)
      + public_ip                           = (known after apply)
      ~ region                              = "uk-london-1" -> (known after apply)
      ~ security_attributes                 = {} -> (known after apply)
      ~ security_attributes_state           = "STABLE" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.uk-london-1.aaaaaaaaocb6yhiygivj4tq5yfhsyyyefivkbtmd3vtiaws5mlhu5ni2bcvq" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2026-02-01 23:50:16.182 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config (known after apply)
      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      ~ availability_config (known after apply)
      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/terraform"
              - "Oracle-Tags.CreatedOn" = "2026-02-01T23:50:15.619Z"
              - "terraform.managed"     = "terraform"
              - "terraform.name"        = "oci-apps"
              - "terraform.repo"        = "https://github.com/batinicaz/oci-apps"
            } -> (known after apply)
          ~ display_name              = "oci-apps" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          + hostname_label            = (known after apply)
          ~ private_ip                = "172.16.0.20" -> (known after apply)
          ~ security_attributes       = {} -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + subnet_cidr               = (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)

          ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ launch_volume_attachments (known after apply)

      ~ licensing_configs (known after apply)

      ~ placement_constraint_details (known after apply)

      ~ platform_config (known after apply)

      ~ preemptible_instance_config (known after apply)

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 2 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 1 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
          + resource_management           = (known after apply)
          ~ vcpus                         = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          ~ boot_volume_vpus_per_gb         = "10" -> (known after apply)
          - is_preserve_boot_volume_enabled = false -> null
            # (4 unchanged attributes hidden)

          ~ instance_source_image_filter_details (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # oci_identity_dynamic_group.this will be updated in-place
  ~ resource "oci_identity_dynamic_group" "this" {
        id             = "ocid1.dynamicgroup.oc1..aaaaaaaaxep7ntfhuk7cuhcgnmyvgjag2fhhbxoefyveb4kdz2npzrsypusq"
      ~ matching_rule  = "instance.id = 'ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7ac4vvxqfciwoeejqx2j2d2tvwhzlgq7gerltfcrow6pzra'" -> (known after apply)
        name           = "oci-apps"
        # (6 unchanged attributes hidden)
    }

  # oci_load_balancer_backend.traefik must be replaced
-/+ resource "oci_load_balancer_backend" "traefik" {
      ~ drain            = false -> (known after apply)
      ~ id               = "loadBalancers/ocid1.loadbalancer.oc1.uk-london-1.aaaaaaaakgjfvnm67avsld5nuuabjxago6nwzr6ssogd5b65zgxdcwvx7xxa/backendSets/traefik/backends/172.16.0.20:80" -> (known after apply)
      ~ ip_address       = "172.16.0.20" -> (known after apply) # forces replacement
      + max_connections  = (known after apply)
      ~ name             = "172.16.0.20:80" -> (known after apply)
      ~ offline          = false -> (known after apply)
      ~ state            = "SUCCEEDED" -> (known after apply)
      ~ weight           = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/fulltextrss-config.php.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content                    = "9c91b01314e52c50a734e084b88a2af4" -> "c9e66449a253d03806b84e1eab9ce448" # forces replacement
      ~ content_length             = "606" -> (known after apply)
      ~ content_md5                = "nJGwExTlLFCnNOCEuIoq9A==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Ffulltextrss-config.php.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "7be954c5-292d-4a74-937b-2f702ce3be55" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # tailscale_tailnet_key.this will be replaced due to changes in replace_triggered_by
-/+ resource "tailscale_tailnet_key" "this" {
      ~ created_at    = "2026-02-01T23:50:15Z" -> (known after apply)
      ~ expires_at    = "2026-02-02T00:00:15Z" -> (known after apply)
      ~ id            = "kNMvJj3Fy421CNTRL" -> (known after apply)
      ~ invalid       = true -> (known after apply)
      ~ key           = (sensitive value)
        tags          = [
            "tag:oci",
        ]
      + user_id       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.

```